[
  {
    "id": 3,
    "title": "Data Scientist",
    "company": "Microsoft",
    "location": "Redmond, WA",
    "type": "Full-time",
    "salaryRange": "$100,000 - $140,000",
    "postedDate": "2025-02-16",
    "employerResponseTime": "3-5 business days",
    "description": "Microsoft is looking for an innovative and highly motivated **Data Scientist** to join our AI & Cloud Data Team. You will work alongside engineers, researchers, and business leaders to build cutting-edge machine learning models, analyze vast datasets, and drive impactful decisions across Microsoft’s global ecosystem.\n\nThis role offers the opportunity to work on AI-driven products at scale, leveraging cloud computing, big data, and advanced statistical techniques to create intelligent solutions for millions of users worldwide.\n\n---\n\n## Responsibilities\n\n### Data Analysis & Insights\n- Analyze large-scale structured and unstructured data from diverse sources such as Azure Cloud, Bing, Office 365, and Windows telemetry.\n- Develop **descriptive, predictive, and prescriptive analytics** to inform key business and product decisions.\n- Conduct **exploratory data analysis (EDA)** to discover trends, correlations, and patterns in high-dimensional datasets.\n\n### Machine Learning & AI Model Development\n- Design, build, and deploy **machine learning models** for applications such as NLP, recommendation systems, forecasting, and anomaly detection.\n- Optimize models using techniques like **hyperparameter tuning, ensemble learning, and feature engineering**.\n- Implement deep learning solutions with **PyTorch, TensorFlow, or Microsoft’s proprietary AI frameworks**.\n- Utilize **Azure Machine Learning** for scalable model deployment and monitoring.\n\n### Data Engineering & Cloud Integration\n- Work with large-scale **cloud data pipelines** using Azure Data Lake, Databricks, and CosmosDB.\n- Design and implement **ETL workflows** to process and clean large datasets efficiently.\n- Optimize data storage and retrieval strategies to improve model performance.\n\n### Business Impact & Decision-Making\n- Translate data-driven insights into actionable business recommendations.\n- Collaborate with product managers, engineers, and executives to integrate AI solutions into Microsoft products.\n- Present findings and model outcomes to both technical and non-technical stakeholders.\n\n---\n\n## Required Qualifications\n- Bachelor's or Master’s degree in Computer Science, Data Science, Statistics, Mathematics, or a related field.\n- 3+ years of experience in data science, machine learning, or a related field.\n- Strong programming skills in **Python, R, or SQL**.\n- Experience with **machine learning frameworks** such as Scikit-learn, PyTorch, or TensorFlow.\n- Proficiency in **data visualization tools** like Matplotlib, Seaborn, or Power BI.\n- Familiarity with **big data technologies** such as Spark, Databricks, and Hadoop.\n- Strong problem-solving skills and the ability to work with complex datasets.\n\n---\n\n## Preferred Qualifications\n- Ph.D. in Data Science, Machine Learning, or a related field.\n- Experience deploying models in a **cloud environment** (Azure, AWS, or GCP).\n- Knowledge of **natural language processing (NLP), reinforcement learning, or generative AI**.\n- Experience working with **Microsoft Azure’s AI and data platforms**.\n- Understanding of **A/B testing and causal inference methods**.\n\n---\n\n## Why Join Microsoft?\n- Work on cutting-edge AI and data science projects with global impact.\n- Collaborate with world-class engineers and researchers.\n- Access Microsoft’s vast cloud computing resources and AI frameworks.\n- Competitive salary, stock options, and industry-leading benefits.\n- Opportunities for career growth and continuous learning.\n\n---\n\n## How to Apply\nInterested candidates should submit their resume and a brief cover letter outlining their experience and interest in the role. Applications can be submitted through Microsoft’s career portal or via email to [recruiting@microsoft.com](mailto:recruiting@microsoft.com).",
    "image": "/logos/microsoft.png"
  },
  {
    "id": 120604,
    "title": "Software Engineer",
    "company": "Apple",
    "location": "San Francisco, CA",
    "type": "Full-time",
    "salaryRange": "$95,000 - $120,000",
    "postedDate": "2025-02-15",
    "employerResponseTime": "3-5 business days",
    "description": "Apple Inc. is at the forefront of innovation, creating technology that transforms lives globally. We are seeking a passionate and skilled **Software Engineer** to join our dynamic engineering team in San Francisco, CA. You will collaborate with designers, product managers, and fellow developers to design, develop, and maintain high-performance web applications that deliver seamless user experiences.\n\nThis role involves full-cycle software development, from concept to deployment, leveraging cutting-edge technologies and best practices to build scalable and secure solutions.\n\n---\n\n## Responsibilities\n\n- Design, develop, and optimize web applications using modern frameworks and cloud services.\n- Collaborate with cross-functional teams to innovate and implement new features.\n- Ensure application performance, security, and scalability through rigorous testing and review.\n- Troubleshoot and resolve software issues efficiently, contributing to continuous improvement.\n\n---\n\n## Qualifications\n\n- Bachelor’s or Master’s degree in Computer Science or related field.\n- 3+ years of experience in full-stack development with proficiency in JavaScript, TypeScript, and modern frameworks.\n- Strong analytical skills and a passion for technology innovation.\n\n---\n\n## Why Join Apple Inc.?\n\n- Be part of a culture that values innovation, collaboration, and excellence.\n- Work on groundbreaking projects that impact millions of users worldwide.\n- Enjoy competitive benefits and career growth opportunities.",
    "image": "/logos/apple.png"
  },
  {
    "id": 42707,
    "title": "Data Analyst",
    "company": "Meta",
    "location": "New York, NY",
    "type": "Full-time",
    "salaryRange": "$75,000 - $90,000",
    "postedDate": "2025-02-01",
    "employerResponseTime": "1 week",
    "description": "Meta is a leader in digital innovation, leveraging data to drive business insights. We are seeking a dedicated **Data Analyst** to join our analytics team in New York, NY. In this role, you will transform complex datasets into actionable insights that inform strategic decision-making and drive business performance.\n\nYou will work closely with stakeholders to develop compelling data visualizations and reporting tools that highlight trends and opportunities.\n\n---\n\n## Responsibilities\n\n- Analyze large datasets to identify trends, patterns, and actionable insights.\n- Develop interactive dashboards and reports using data visualization tools.\n- Collaborate with cross-functional teams to address data needs and business challenges.\n- Maintain data integrity and ensure accuracy in all analyses.\n\n---\n\n## Qualifications\n\n- Bachelor’s degree in Data Science, Statistics, or related field.\n- Proficiency in SQL, Python, or R and experience with data visualization tools.\n- Strong analytical skills with a keen attention to detail.\n\n---\n\n## Why Join Meta?\n\n- Engage with cutting-edge data analytics projects.\n- Collaborate with industry experts in a dynamic work environment.\n- Enjoy competitive compensation and growth opportunities.",
    "image": "/logos/meta.png"
  },
  {
    "id": 562734,
    "title": "Marketing Coordinator",
    "company": "Coca-Cola",
    "location": "Chicago, IL",
    "type": "Part-Time",
    "salaryRange": "$45,000 - $65,000",
    "postedDate": "2025-01-31",
    "employerResponseTime": "2-3 business days",
    "description": "Coca-Cola is synonymous with iconic brand excellence and innovation in marketing. We are looking for a creative **Marketing Coordinator** to join our team in Chicago, IL. In this role, you will support the development and execution of digital marketing campaigns, content creation, and social media strategies that enhance brand visibility and engagement.\n\nYou will collaborate with marketing professionals to conduct market research, analyze trends, and deliver compelling content that resonates with our audience.\n\n---\n\n## Responsibilities\n\n- Assist in planning and executing marketing campaigns across various channels.\n- Manage social media content and collaborate on digital marketing initiatives.\n- Conduct market research and analyze competitor strategies to drive innovation.\n- Monitor and report on campaign performance to optimize results.\n\n---\n\n## Qualifications\n\n- Bachelor’s degree in Marketing, Communications, or a related field.\n- Strong creative and communication skills with a passion for storytelling.\n- Familiarity with SEO, digital analytics, and social media platforms.\n\n---\n\n## Why Join Coca-Cola?\n\n- Be part of a world-renowned brand with a legacy of excellence.\n- Work in a dynamic, creative environment with opportunities for professional growth.\n- Enjoy flexible work arrangements and competitive benefits.",
    "image": "/logos/cocacola.png"
  },
  {
    "id": 716294,
    "title": "Cybersecurity Analyst",
    "company": "Microsoft",
    "location": "Austin, TX",
    "type": "Full-time",
    "salaryRange": "$85,000 - $110,000",
    "postedDate": "2025-02-03",
    "employerResponseTime": "1-2 weeks",
    "description": "Microsoft is a global leader in cybersecurity, dedicated to protecting digital assets and infrastructure. We are seeking a vigilant **Cybersecurity Analyst** to join our security team in Austin, TX. In this role, you will proactively monitor and safeguard networks, perform risk assessments, and implement security measures to defend against cyber threats.\n\nYou will work in a collaborative environment where innovation and continuous learning drive excellence in digital security.\n\n---\n\n## Responsibilities\n\n- Monitor network activity and identify potential security threats.\n- Conduct penetration testing and perform detailed risk assessments.\n- Implement and maintain security protocols to protect sensitive data.\n- Stay abreast of cybersecurity trends and emerging threats.\n\n---\n\n## Qualifications\n\n- Bachelor’s degree in Cybersecurity, Computer Science, or related field.\n- Experience with firewalls, SIEM tools, and network security best practices.\n- Strong analytical and problem-solving skills.\n\n---\n\n## Why Join Microsoft?\n\n- Contribute to a mission-critical team safeguarding digital environments.\n- Collaborate with top security professionals and industry experts.\n- Access competitive benefits and career advancement opportunities.",
    "image": "/logos/microsoft.png"
  },
  {
    "id": 160603,
    "title": "Legal Assistant",
    "company": "Skadden, Arps, Slate, Meagher & Flom LLP",
    "location": "Washington, D.C.",
    "type": "Full-time",
    "salaryRange": "$55,000 - $70,000",
    "postedDate": "2025-12-08",
    "employerResponseTime": "1-2 weeks",
    "description": "Skadden, Arps, Slate, Meagher & Flom LLP is a prestigious legal firm renowned for excellence in legal services. We are seeking a diligent **Legal Assistant** to support our attorneys in Washington, D.C. In this role, you will conduct legal research, draft documentation, and assist in case management to ensure seamless legal operations.\n\nYou will work in a fast-paced environment where attention to detail and confidentiality are paramount.\n\n---\n\n## Responsibilities\n\n- Conduct legal research and prepare comprehensive reports.\n- Draft, review, and manage legal documents and case files.\n- Assist attorneys in trial preparation and case management.\n- Maintain confidentiality and adhere to legal ethics.\n\n---\n\n## Qualifications\n\n- Bachelor’s degree in Law, Political Science, or related field.\n- Experience in a legal setting with strong organizational skills.\n- Excellent written and verbal communication skills.\n\n---\n\n## Why Join Skadden?\n\n- Work with a top-tier legal team on high-profile cases.\n- Engage in professional development in a dynamic legal environment.\n- Enjoy competitive benefits and opportunities for career growth.",
    "image": "/logos/skadden.png"
  },
  {
    "id": 894623,
    "title": "Financial Analyst",
    "company": "JPMorgan Chase",
    "location": "Boston, MA",
    "type": "Full-time",
    "salaryRange": "$80,000 - $100,000",
    "postedDate": "2025-02-04",
    "employerResponseTime": "1 week",
    "description": "JPMorgan Chase is a leader in financial advisory services, delivering strategic investment insights and innovative solutions. We are looking for a meticulous **Financial Analyst** to join our team in Boston, MA. In this role, you will develop financial models, analyze market trends, and support investment decisions with in-depth research.\n\nYou will work closely with senior analysts to drive business success through data-driven financial strategies.\n\n---\n\n## Responsibilities\n\n- Conduct detailed financial modeling and forecasting.\n- Analyze market trends and evaluate investment opportunities.\n- Prepare comprehensive financial reports and presentations.\n- Support senior management in risk assessment and portfolio management.\n\n---\n\n## Qualifications\n\n- Bachelor’s degree in Finance, Economics, or Accounting.\n- Strong proficiency in Excel, financial software, and SQL.\n- Excellent analytical and communication skills.\n\n---\n\n## Why Join JPMorgan Chase?\n\n- Be part of a world-renowned financial institution.\n- Work on challenging projects with significant business impact.\n- Enjoy competitive compensation and robust career development opportunities.",
    "image": "/logos/chase.png"
  },
  {
    "id": 257194,
    "title": "Technical Support Specialist",
    "company": "Dell",
    "location": "Denver, CO",
    "type": "Part-Time",
    "salaryRange": "$46,000 - $58,000",
    "postedDate": "2025-02-02",
    "employerResponseTime": "3-5 business days",
    "description": "Dell is a global leader in technology solutions, committed to providing exceptional IT support and innovative services. We are seeking a dedicated **Technical Support Specialist** to join our team in Denver, CO. In this role, you will troubleshoot software and hardware issues, provide technical assistance, and ensure outstanding customer service.\n\nYou will collaborate with a skilled IT team to enhance the user experience and resolve technical challenges efficiently.\n\n---\n\n## Responsibilities\n\n- Provide prompt and effective technical support to customers.\n- Troubleshoot and resolve IT issues across multiple platforms.\n- Install, configure, and maintain software and hardware systems.\n- Document technical procedures and solutions.\n\n---\n\n## Qualifications\n\n- Associate’s or Bachelor’s degree in IT or related field.\n- Experience with Windows, Mac, and Linux operating systems.\n- Strong troubleshooting and customer service skills.\n\n---\n\n## Why Join Dell?\n\n- Work for a renowned tech leader known for innovation.\n- Collaborate in a dynamic and supportive IT environment.\n- Enjoy competitive benefits and flexible work arrangements.",
    "image": "/logos/dell.png"
  },
  {
    "id": 120301,
    "title": "HR Manager",
    "company": "Tesla",
    "location": "Los Angeles, CA",
    "type": "Full-time",
    "salaryRange": "$85,000 - $110,000",
    "postedDate": "2025-01-30",
    "employerResponseTime": "2 weeks",
    "description": "Tesla is revolutionizing the automotive and energy industries, driven by a passion for innovation and sustainability. We are seeking a dynamic **HR Manager** to lead talent acquisition, employee engagement, and compliance initiatives at our Los Angeles, CA headquarters.\n\nIn this role, you will develop and implement HR strategies that foster a culture of diversity, inclusion, and excellence. You will work closely with cross-functional teams to ensure that our workforce is engaged, supported, and aligned with Tesla’s visionary goals.\n\n---\n\n## Responsibilities\n\n- Oversee recruitment, hiring, and onboarding processes.\n- Develop and implement HR policies in compliance with labor laws.\n- Manage employee relations and performance management initiatives.\n- Create and facilitate training and professional development programs.\n\n---\n\n## Qualifications\n\n- Bachelor’s or Master’s degree in Human Resources or related field.\n- 5+ years of HR experience in a managerial role.\n- Strong interpersonal and communication skills.\n\n---\n\n## Why Join Tesla?\n\n- Be part of a pioneering company shaping the future of transportation and energy.\n- Work in an innovative environment that values diversity and growth.\n- Enjoy competitive benefits and exciting career advancement opportunities.",
    "image": "/logos/tesla.png"
  },
  {
    "id": 231015,
    "title": "Content Writer",
    "company": "JYP Entertainment",
    "location": "Remote",
    "type": "Part-Time",
    "salaryRange": "$50,000 - $80,000",
    "postedDate": "2024-12-13",
    "employerResponseTime": "1 week",
    "description": "JYP Entertainment is a leading digital media agency known for creative storytelling and innovative content creation. We are looking for a talented **Content Writer** to join our remote team and craft high-quality articles, blogs, and marketing copy.\n\nIn this role, you will conduct research, generate original ideas, and produce engaging content that resonates with diverse audiences. You will work collaboratively with our marketing team to shape content strategies that drive online engagement.\n\n---\n\n## Responsibilities\n\n- Create compelling content for various digital platforms.\n- Conduct thorough research to ensure factual accuracy and creativity.\n- Collaborate with marketing teams to develop and refine content strategies.\n- Optimize content for SEO and audience engagement.\n\n---\n\n## Qualifications\n\n- Bachelor’s degree in Journalism, English, or related field.\n- Exceptional writing, editing, and proofreading skills.\n- Familiarity with WordPress and SEO best practices.\n\n---\n\n## Why Join JYP Entertainment?\n\n- Engage with a creative team at a leading digital media agency.\n- Work remotely with flexible hours and dynamic projects.\n- Enjoy competitive compensation and opportunities for professional growth.",
    "image": "/logos/jyp.png"
  },
  {
    "id": 159283,
    "title": "Sales Representative",
    "company": "AT&T",
    "location": "Dallas, TX",
    "type": "Full-time",
    "salaryRange": "$50,000 - $75,000",
    "postedDate": "2025-01-27",
    "employerResponseTime": "3-5 business days",
    "description": "AT&T is a telecommunications giant known for its innovative solutions and commitment to customer service. We are seeking a driven **Sales Representative** to join our team in Dallas, TX. In this role, you will identify new business opportunities, develop client relationships, and drive revenue growth through effective sales strategies.\n\nYou will work closely with a dynamic sales team to deliver exceptional service and exceed targets.\n\n---\n\n## Responsibilities\n\n- Identify and pursue new business opportunities.\n- Build and maintain strong client relationships.\n- Present products and services in a compelling manner.\n- Achieve sales targets and contribute to revenue growth.\n\n---\n\n## Qualifications\n\n- Bachelor’s degree in Business or related field.\n- Proven experience in sales or account management.\n- Excellent communication and negotiation skills.\n\n---\n\n## Why Join AT&T?\n\n- Be part of a leading telecommunications company.\n- Work in a fast-paced, goal-driven environment.\n- Enjoy competitive benefits and career development opportunities.",
    "image": "/logos/att.png"
  },
  {
    "id": 812937,
    "title": "Electrical Engineer",
    "company": "Lockheed Martin",
    "location": "Houston, TX",
    "type": "Full-time",
    "salaryRange": "$85,000 - $105,000",
    "postedDate": "2024-12-28",
    "employerResponseTime": "2 weeks",
    "description": "Lockheed Martin is a pioneer in defense and aerospace technology, delivering advanced electrical engineering solutions. We are seeking a skilled **Electrical Engineer** to join our team in Houston, TX. In this role, you will design, develop, and test innovative electrical systems and components that power next-generation solutions.\n\nYou will collaborate with multidisciplinary teams to ensure that our designs meet rigorous safety and performance standards.\n\n---\n\n## Responsibilities\n\n- Design, develop, and test electrical systems and components.\n- Create innovative power distribution and circuit design solutions.\n- Ensure compliance with industry safety standards and regulations.\n- Collaborate with cross-functional teams on cutting-edge projects.\n\n---\n\n## Qualifications\n\n- Bachelor’s degree in Electrical Engineering or related field.\n- Proficiency in AutoCAD and electrical simulation tools.\n- Strong problem-solving and analytical skills.\n\n---\n\n## Why Join Lockheed Martin?\n\n- Work with a global leader in aerospace and defense technology.\n- Engage in projects that push the boundaries of electrical engineering.\n- Enjoy competitive compensation and extensive career development opportunities.",
    "image": "/logos/lockheed-martin.png"
  },
  {
    "id": 281203,
    "title": "Project Manager",
    "company": "General Electric (GE)",
    "location": "Seattle, WA",
    "type": "Full-time",
    "salaryRange": "$90,000 - $115,000",
    "postedDate": "2025-02-15",
    "employerResponseTime": "2 weeks",
    "description": "General Electric (GE) is a trailblazer in innovative construction and infrastructure solutions, committed to excellence in project management. We are seeking a seasoned **Project Manager** to oversee large-scale projects in Seattle, WA. In this role, you will plan, execute, and deliver projects on time and within budget, coordinating efforts across diverse teams and stakeholders.\n\nYou will leverage strategic planning and innovative problem-solving skills to drive project success and operational excellence.\n\n---\n\n## Responsibilities\n\n- Develop and manage comprehensive project plans, budgets, and timelines.\n- Coordinate with architects, engineers, and contractors to ensure project success.\n- Monitor progress and mitigate risks throughout the project lifecycle.\n- Ensure compliance with safety, quality, and regulatory standards.\n\n---\n\n## Qualifications\n\n- Bachelor’s degree in Construction Management, Engineering, or related field.\n- PMP certification preferred with 5+ years of project management experience.\n- Strong organizational and leadership skills.\n\n---\n\n## Why Join GE?\n\n- Be part of a renowned organization driving innovation in infrastructure.\n- Collaborate with industry experts on challenging and impactful projects.\n- Enjoy competitive compensation and professional growth opportunities.",
    "image": "/logos/ge.png"
  },
  {
    "id": 251803,
    "title": "Social Media Manager",
    "company": "Twitter (X)",
    "location": "Miami, FL",
    "type": "Part-Time",
    "salaryRange": "$50,000 - $75,000",
    "postedDate": "2025-01-22",
    "employerResponseTime": "1-2 weeks",
    "description": "Twitter (X) is a dynamic digital marketing agency dedicated to elevating brand presence across social platforms. We are seeking a creative **Social Media Manager** to join our team in Miami, FL. In this role, you will develop and execute innovative social media campaigns that drive engagement, growth, and brand awareness.\n\nYou will collaborate with content creators and marketing strategists to craft compelling narratives and optimize social interactions.\n\n---\n\n## Responsibilities\n\n- Develop and implement social media strategies across multiple platforms.\n- Create and curate engaging content tailored for social media.\n- Monitor social media metrics and optimize campaigns based on performance.\n- Engage with online communities to build brand loyalty.\n\n---\n\n## Qualifications\n\n- Bachelor’s degree in Marketing, Communications, or related field.\n- 3+ years of experience in social media management.\n- Strong storytelling and content creation skills.\n\n---\n\n## Why Join Twitter (X)?\n\n- Work with a forward-thinking team in a vibrant digital environment.\n- Leverage cutting-edge tools and strategies to drive brand engagement.\n- Enjoy competitive benefits and flexible work arrangements.",
    "image": "/logos/X_logo.webp"
  },
  {
    "id": 482193,
    "title": "Customer Service Representative",
    "company": "Amazon",
    "location": "Phoenix, AZ",
    "type": "Full-time",
    "salaryRange": "$40,000 - $55,000",
    "postedDate": "2025-02-09",
    "employerResponseTime": "3 business days",
    "description": "Amazon is a leader in customer-centric innovation, dedicated to delivering exceptional service experiences. We are seeking an empathetic **Customer Service Representative** to join our team in Phoenix, AZ. In this role, you will manage customer inquiries, resolve issues efficiently, and uphold high service standards.\n\nYou will work collaboratively with various teams to enhance customer satisfaction and drive continuous improvement.\n\n---\n\n## Responsibilities\n\n- Handle inbound and outbound customer communications with professionalism.\n- Resolve customer complaints and technical issues promptly.\n- Maintain accurate records and provide timely product information.\n- Collaborate with internal teams to improve the customer experience.\n\n---\n\n## Qualifications\n\n- High school diploma or equivalent (Bachelor’s degree preferred).\n- Previous experience in customer service is a plus.\n- Strong communication and problem-solving skills.\n\n---\n\n## Why Join Amazon?\n\n- Be part of an innovative company focused on customer satisfaction.\n- Work in a fast-paced, supportive environment with growth opportunities.\n- Enjoy competitive benefits and professional development resources.",
    "image": "/logos/amazon.png"
  },
  {
    "id": 454156,
    "title": "Electrical Engineer",
    "company": "Boeing",
    "location": "Houston, TX",
    "type": "Full-time",
    "salaryRange": "$80,000 - $105,000",
    "postedDate": "2024-12-28",
    "employerResponseTime": "2 weeks",
    "description": "Boeing is an industry leader in aerospace and power solutions, renowned for its innovation in electrical engineering. We are seeking a talented **Electrical Engineer** to join our team in Houston, TX. In this role, you will design, develop, and implement advanced electrical systems that power cutting-edge aerospace technologies.\n\nYou will collaborate with multidisciplinary teams to drive innovation and ensure adherence to rigorous safety standards.\n\n---\n\n## Responsibilities\n\n- Design, develop, and test innovative electrical circuits and systems.\n- Develop solutions for power distribution and energy efficiency.\n- Ensure compliance with electrical codes and safety regulations.\n- Collaborate with engineers across disciplines on groundbreaking projects.\n\n---\n\n## Qualifications\n\n- Bachelor’s degree in Electrical Engineering or related field.\n- Proficiency in AutoCAD, circuit design, and simulation tools.\n- Strong analytical and problem-solving skills.\n\n---\n\n## Why Join Boeing?\n\n- Work with a global leader in aerospace technology.\n- Engage in challenging projects that redefine engineering standards.\n- Enjoy competitive compensation and exceptional career development opportunities.",
    "image": "/logos/boeing.png"
  },
  {
    "id": 552352,
    "title": "Corporate Lawyer",
    "company": "CalPal",
    "location": "Norman, OK",
    "type": "Full-time",
    "salaryRange": "$120,000 - $160,000",
    "postedDate": null,
    "employerResponseTime": null,
    "description": "CalPal is a rapidly growing technology company revolutionizing the way individuals manage their schedules and tasks. We are seeking a **Corporate Lawyer** to join our legal team and oversee compliance, contracts, intellectual property, and regulatory matters. This role is crucial in ensuring that CalPal operates within all applicable legal frameworks while supporting our mission of innovation and user empowerment.\n\nAs our **Corporate Lawyer**, you will work closely with leadership, product development teams, and external counsel to navigate complex legal challenges in the tech industry. You will play a key role in shaping policies, mitigating risks, and protecting the company’s intellectual property and business interests.\n\n---\n\n## Responsibilities\n\n- Draft, review, and negotiate contracts, including SaaS agreements, NDAs, and vendor agreements.\n- Ensure compliance with data privacy laws (GDPR, CCPA) and regulatory frameworks.\n- Provide legal guidance on intellectual property, trademarks, and licensing.\n- Advise on employment law, corporate governance, and risk management.\n- Stay updated on industry regulations affecting the tech sector.\n- Collaborate with external counsel on litigation and complex legal matters.\n- Develop internal policies and legal best practices for CalPal’s operations.\n\n---\n\n## Qualifications\n\n- J.D. (Juris Doctor) from an accredited law school.\n- Licensed to practice law in the United States (California Bar preferred).\n- 5+ years of experience in corporate law, preferably in the tech or SaaS industry.\n- Expertise in contract law, IP law, and regulatory compliance.\n- Strong negotiation and analytical skills.\n- Ability to work independently while collaborating with cross-functional teams.\n- Experience with startup legal frameworks is a plus.\n\n---\n\n## Why Join CalPal?\n\n- Be part of a rapidly growing company at the forefront of technology innovation.\n- Collaborate with industry experts and legal professionals in a dynamic environment.\n- Enjoy competitive compensation, benefits, and opportunities for professional growth.",
    "image": "/logos/calpal.png"
  }
]
